OyakXD/STM32Microcontrollers_Practices/pratica_2/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include "stm32f1xx.h"

/*
 * EXTI0 external interrupt handler
 */
void EXTI0_IRQHandler(void)
{
	// Do stuff
	GPIOC->ODR ^= (1 << 13);
	// Clear pending
	EXTI->PR = (1 << 0);
}

/*
 * EXTI1 external interrupt handler
 */
void EXTI1_IRQHandler(void)
{
	// Do stuff
	GPIOA->ODR ^= (1 << 6);
	// Clear pending
	EXTI->PR = (1 << 1);
}


void EXTI3_IRQHandler(void)
{
	GPIOA->ODR ^= (1 << 7);

	EXTI->PR = (1 << 3);
}


int main(void)
{
	// Set bit 2 to enable GPIOA clock
	RCC->APB2ENR |= (1 << 2);
	// Set Bit 3 to enable GPIOB clock
	RCC->APB2ENR |= (1 << 3);
	// Set Bit 4 to enable GPIOC clock
	RCC->APB2ENR |= (1 << 4);

	GPIOA->CRL &= 0x00FFFFFF;
	GPIOA->CRL |= 0x22000000;

	// Make GPIOB Pin0 and Pin1 and Pin3 input
	GPIOB->CRL &= 0xFFFF0F00;
	GPIOB->CRL |= 0x00008088;
	//Enable GPIO Pin0 and Pin1 and Pin3 pull-up
	GPIOB->ODR = 0x00000000B;

	// Make GPIOE Pin13 output
	GPIOC->CRH &= 0xFF0FFFFF;
	GPIOC->CRH |= 0x00200000;

	// Reset GPIOC Pin13
	GPIOC->ODR |= (1 << 13);

	// Since we will use Alternate Function (EXTI) we need to enable the
	//   clock for that module. Bit0 in RCC APB2ENR register
	RCC->APB2ENR |= (1 << 0); // AFIO Clock enable

	// EXTI0 can be configured for each GPIO module.
	//   EXTICR1: 0b XXXX XXXX XXXX 0001
	//               pin3 pin2 pin1 pin0
	//
	//   Writing a 0b0001 to pin0 location ties PB0 to EXT0
	AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI0_PB; // Tie PB0 to EXTI0

	// EXTI1 can be configured for each GPIO module.
	//   EXTICR1: 0b XXXX XXXX 0001 XXXX
	//               pin3 pin2 pin1 pin0
	//
	//   Writing a 0b0001 to pin1 location ties PB1 to EXT1
	AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI1_PB; // Tie PB1 to EXTI1

	// EXTI3 can be configured for each GPIO module.
	//   EXTICR1: 0b 0001 XXXX XXXX XXXX
	//               pin3 pin2 pin1 pin0
	//
	//   Writing a 0b0001 to pin1 location ties PB3 to EXT1
	AFIO->EXTICR[0] |= AFIO_EXTICR1_EXTI3_PB;

	AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_JTAGDISABLE;
	// Next we choose either falling edge trigger (FTSR) or falling edge trigger (FTSR)
	/*
	EXTI->FTSR |= 0x00001;   // Enable falling edge trigger on EXTI0
	EXTI->FTSR |= 0x00002;   // Enable falling edge trigger on EXTI1
	EXTI->FTSR |= 0x00008;   // Enable falling edge trigger on EXTI3
	 */
	EXTI->FTSR |= 0x0000B;
	// We mask the used external interrupt numbers.
	/*
	EXTI->IMR |= 0x00001;    // Mask EXTI0
	EXTI->IMR |= 0x00002;    // Mask EXTI1
	EXTI->IMR |= 0x00008;	 // Mask EXTI3
	*/
	EXTI->IMR |= 0x0000B;
	// Set Priority for each interrupt request
	// STM32F103 supports 4-bit priority level (highest 4-bits are implemented)
	NVIC_SetPriority(EXTI0_IRQn,0x10); // Priority level 1
	NVIC_SetPriority(EXTI1_IRQn,0x20); // Priority level 2
	NVIC_SetPriority(EXTI3_IRQn, 0x30); // Priority level 3

	// Enable EXTI0 interrupt on NVIC
	NVIC_EnableIRQ(EXTI0_IRQn);
	// Enable EXTI1 interrupt on NVIC
	NVIC_EnableIRQ(EXTI1_IRQn);
	// Enable EXTI3 interrupt on NVIC
	NVIC_EnableIRQ(EXTI3_IRQn);

	__enable_irq();	//NECESSARY IN THIS CODE??? - WHY ???

	while(1)
	{

	}
}
